package com.javaex.ex01;

public class Goods {
	
	//필드
	String name;
	int price;
	
	//생성자
	
	//메소드 - 겟터세터
	
	//메소드 - 일반
//	public static void main(String[] args) {
//		메모리 운영 스토리 작성 
//	}
	
	//*************************
	//보통의 경우 이렇게 만든다
	//필드 작성
	
	//생성자 --> 자동 생성 단축키 
	//ㄴ 기본 생성자 
	//ㄴ 생성자(모든 필드 값)
	
	//메소드 - gs 다 만들어준다 --> 자동생성 단축키 
	
	//메소드 - 일반 
	//ㄴ테스트 위한 toString() --> 자동 생성 단축키 
	
	//****생성자의 세부 규칙
	// 1. 생성자 오버로딩 
	// 2. 다른 생성자 만들면 디폴트 생성자 없어지기 때문에 위에 디폴트 생성자 만들어주기  
	
	///*********
	//super() 
}
